from quran_transcript.tasmeea import tasmeea_sura, check_sura_missing_parts

if __name__ == "__main__":
    sura_list = [
        ["بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"],
        ["قُلْ أَعُوذُ بِرَبِّ النَّاسِ"],
        ["مَلِكِ النَّاسِ"],
        ["إِلَهِ النَّاسِ"],
        ["مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ"],
        ["الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ"],
        ["مِنَ الْجِنَّةِ وَالنَّاسِ"],
        ["صَدَقَ اللَّهُ الْعَظِيمُ"],
    ]
    # sura_list = [
    #     ["بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"],
    #     ["قُلْ أَعُوذُ بِرَبِّ النَّاسِ"],
    #     ["llllllllllllllllllllllllll"],
    #     ["إِلَهِ النَّاسِ"],
    #     ["مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ"],
    #     ["الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ"],
    #     ["مِنَ الْجِنَّةِ وَالنَّاسِ"],
    #     ["صَدَقَ اللَّهُ الْعَظِيمُ"],
    # ]
    # sura_list = [
    #     ["بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"],
    #     ["قُلْ أَعُوذُ بِرَبِّ النَّاسِ"],
    #     ["lll"],
    #     ["إِلَهِ النَّاسِ"],
    #     ["مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ"],
    #     ["الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ"],
    #     ["مِنَ الْجِنَّةِ وَالنَّاسِ"],
    #     ["صَدَقَ اللَّهُ الْعَظِيمُ"],
    # ]
    # sura_list = [
    #     ["بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"],
    #     ["قُلْ أَعُوذُ بِرَبِّ النَّاسِ"],
    #     ["lll"],
    #     ["lllllll"],
    #     ["مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ"],
    #     ["الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ"],
    #     ["مِنَ الْجِنَّةِ وَالنَّاسِ"],
    #     ["صَدَقَ اللَّهُ الْعَظِيمُ"],
    # ]
    # sura_list = [
    #     ["بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"],
    #     ["قُلْ أَعُوذُ بِرَبِّ النَّاسِ"],
    #     ["lll"],
    #     ["lllllll"],
    #     ["مِنْ شَرِّ الْوَسْوَاسِ"],
    #     ["الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ"],
    #     ["مِنَ الْجِنَّةِ وَالنَّاسِ"],
    #     ["صَدَقَ اللَّهُ الْعَظِيمُ"],
    # ]
    #
    # sura_list = [
    #     ["بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"],
    #     ["قُلْ أَعُوذُ بِرَبِّ النَّاسِ"],
    #     ["lll"],
    #     ["lllllll"],
    #     ["lllllllllll"],
    #     ["الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ"],
    #     ["مِنَ الْجِنَّةِ وَالنَّاسِ"],
    #     ["صَدَقَ اللَّهُ الْعَظِيمُ"],
    # ]
    # sura_list = [
    #     ["llllllllll"],
    #     ["قُلْ أَعُوذُ بِرَبِّ النَّاسِ"],
    #     ["lll"],
    #     ["lllllll"],
    #     ["llllllllllllllllllllllllllllllllllllllllllllllllllllllllllll"],
    #     ["الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ"],
    #     ["مِنَ الْجِنَّةِ وَالنَّاسِ"],
    #     ["صَدَقَ اللَّهُ الْعَظِيمُ"],
    # ]
    # sura_list = [
    #     ["بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"],
    #     ["llskdjslkj"],
    #     ["مَلِكِ النَّاسِ"],
    #     ["lllllllllllllkjs"],
    #     ["مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ"],
    #     ["skjflkdjfkljkljs"],
    #     ["مِنَ الْجِنَّةِ وَالنَّاسِ"],
    #     ["صَدَقَ اللَّهُ الْعَظِيمُ"],
    # ]
    # # with bismillah
    # sura_list = [
    #     ["بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ قُلْ أَعُوذُ"],
    #     ["lllllllllllllllllllllllll"],
    #     ["مَلِكِ النَّاسِ"],
    #     ["إِلَهِ النَّاسِ"],
    #     [""],
    #     ["مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ"],
    #     ["الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ"],
    #     ["مِنَ الْجِنَّةِ وَالنَّاسِ"],
    #     ["صَدَقَ اللَّهُ الْعَظِيمُ"],
    # ]
    sura_list = [
        ["بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ قُلْ أَعُوذُ"],
        ["lllllllllllllllllllllllll"],
        ["مَلِكِ النَّاسِ"],
        ["إِلَهِ النَّاسِ"],
        ["l"],
        ["مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ"],
        ["الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ"],
        ["مِنَ الْجِنَّةِ وَالنَّاسِ"],
        ["صَدَقَ اللَّهُ الْعَظِيمُ"],
    ]
    #
    # sura_list = [
    #     ["بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ قُلْ أَعُوذُ"],
    #     ["lllllllllllllllllllllllll"],
    #     ["مَلِكِ النَّاسِ"],
    #     ["إِلَهِ النَّاسِ"],
    #     ["مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ"],
    # ]

    outs = tasmeea_sura(
        [s[0] for s in sura_list],
        114,
        overlap_words=16,
        window_words=32,
        acceptance_ratio=0.85,
    )
    print([o[0] for o in outs])
    for out in outs:
        print(out)

    print("=" * 80)
    print("Missing Segments:")
    missing_parts = check_sura_missing_parts(
        sura_idx=114, fixed_segments=[o[0] for o in outs]
    )
    for p in missing_parts:
        print(p)
    print(missing_parts)
